Examples/Lagrangian/hotStream/constant/injectFromTopProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      kinematicCloud1Properties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solution
{
    active          true;
    coupled         true;
    transient       yes;
    cellValueSourceCorrection on;

    sourceTerms
    {
        schemes
        {
            rho             explicit 1;
            U               explicit 1;
            Yi              explicit 1;
            hs              explicit 1;
        }
    }

    interpolationSchemes
    {
        rhoPseudo             cell;
        U               cellPoint;
        mu              cell;
        T               cell;
        Cp              cell;
        p               cell;
    }

    integrationSchemes
    {
        U               Euler;
        T               analytical;
    }
}

cellValueSourceCorrection on;

constantProperties
{
    parcelTypeId    1;

    rhoMin           1e-15;
    minParticleMass  1e-15;
    rho0             5000;

    youngsModulus   1e9;
    poissonsRatio   0.35;
}

subModels
{
    injectionModel  coneInjection;

    dispersionModel none;

    // patchInteractionModel rebound;
    patchInteractionModel standardWallInteraction;

    surfaceFilmModel none;

    PostProcessingModel PatchPostProcessing;

    particleForces
    {
        gravity         on;
        sphereDrag on;
        //        virtualMass     off;
        //        pressureGradient off;
    }

    coneInjectionCoeffs
    {
        massTotal        0.002;
        parcelBasisType mass;

        SOI             0.001;
        duration        0.5;
        positionAxis    (
            (( 0.05 0.09 0.005 )( 0 -1 0 ))
        );
        parcelsPerInjector 10000;
        flowRateProfile  constant 0.00001;
        Umag            constant 5e-1;
        thetaInner      constant 0;
        thetaOuter      constant 30;

        sizeDistribution
        {
            type         uniform;
            //        pdfType         RosinRammler;
            RosinRammlerPDF
            {
                minValue        5e-05;
                maxValue        0.001;
                d                7.5e-05;
                n                0.5 ;
            }
            uniformDistribution
            {
                minValue 5e-5;
                maxValue 1e-3;
            }
        }
    }

    standardWallInteractionCoeffs
    {
        type            rebound;
    }

    reboundCoeffs
    {
        UFactor 1;
    }

}

cloudFunctions
{
    patchPostProcessing
    {
        maxStoredParcels 10000;
        patches ( right );
    }
}

// ************************************************************************* //
